["(Ever told) you had a heart attack, also called a myocardial infarction?", "(Ever told) you had angina or coronary heart disease?", "(Ever told) you had a stroke.", "(Ever told) you had asthma?", "Do you still have asthma?", "(Ever told) you had skin cancer?", "(Ever told) you had any other types of cancer?", "(Ever told) you have chronic obstructive pulmonary disease, C.O.P.D., emphysema or chronic bronchitis?", "(Ever told) you have some form of arthritis, rheumatoid arthritis, gout, lupus, or fibromyalgia?", "(Ever told) you have kidney disease?", "(Ever told) you have diabetes", "How old were you when you were told you have diabetes?", "How many of these telephone numbers are residential numbers?", "Have you ever served on active duty in the United States Armed Forces, either in the regular military or in a National Guard or military reserve unit?", "Are you currently…?", "About how much do you weigh without shoes?", "About how tall are you without shoes?", "To your knowledge, are you now pregnant?", "Are you deaf or do you have serious difficulty hearing?", "Are you blind or do you have serious difficulty seeing, even when wearing glasses?", "Do you have serious difficulty walking or climbing stairs?", "Do you have difficulty dressing or bathing?", "(Ever told) you have Chronic Obstructive Pulmonary Disease or COPD, emphysema or chronic bronchitis?", "Do you now have any health problem that requires you to use special equipment, such as a cane, a wheelchair, a special bed, or a special telephone?", "Thinking about all the phone calls that you receive on your landline or cell phone, what percent, between 0 and 100, are received on your cell phone?", "Did you vote in the last presidential election?", "(Ever told) you have kidney disease? Do NOT include kidney stones, bladder infection or incontinence.", "About how much do you weigh without shoes? (Note: If respondent answers in metrics, put a \"9\" in first column)[Round fractions up]", "About how tall are you without shoes? (Note: If respondent answers in metrics, put a \"9\" in first column)[Round fractions down.] (variable name change)", "How many of these are residential numbers?", "To your knowledge, are you now pregnant?   (Note: This question was previously in the Women's Health section. This question was only asked of female respondents.)", "[Prologue] Do you now have any health problem that requires you to use special equipment, such as a cane, a wheelchair, a special bed, or a special telephone? Include occasional use or use in certain circumstances.", "Do you have any trouble seeing, even when wearing glasses or contact lenses?", "Are you currently:", "(Ever told) you have (COPD) chronic obstructive pulmonary disease, emphysema or chronic bronchitis?", "Has a doctor, nurse or other health professional ever said that you have vision impairment in one or both eyes, even when wearing glasses?", "Have you ever served on active duty in the United States Armed Forces, either in the regular military or in a National Guard or military reserve unit? Active duty does not include training for the Reserves or National Guard, but DOES include activation, for example, for the Persian Gulf War. (Variable name change)(Question sometimes appears in Veteran's Status section)", "During the past 12 months, has your household been without landline telephone service for 1 week or more? Do not include interruptions of landline telephone service because of weather or natural disasters.", "[Prologue] Did you vote in the last presidential election? The November 2008 election between Barack Obama and John McCain?", "How much did you weigh a year ago? [If you were pregnant a year ago, how much did you weigh before your pregnancy?] (Note: If respondent answers in metrics, put a \"9\" in first column)[Round fractions up]", "Was the change between your current weight and your weight a year ago intentional?", "During the past 12 months, has your household been without telephone service for 1 week or more? Do not include interruptions of telephone service because of weather or natural disasters. (Variable name change)", "Do you have more than one telephone number in your household?  Do not include cell phones or numbers that are only used by a computer or fax machine.", "Not including cell phones or numbers used for computers, fax machines or security systems, do you have more than one telephone number in your household?"]